In [78]:
import pandas as pd
import numpy as np
import sklearn
import tensorflow as tf
from tensorflow import keras
import matplotlib.pyplot as plt

In [79]:
df=pd.read_csv('Churn Modeling.csv')

In [80]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [81]:
df.drop(['RowNumber','CustomerId','Surname'],inplace=True,axis=1)

In [82]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [83]:
df.shape

(10000, 11)

In [84]:
df.isna().any()

CreditScore        False
Geography          False
Gender             False
Age                False
Tenure             False
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

In [85]:
df.dropna(inplace=True)

In [86]:
df['Geography'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [87]:
from sklearn.preprocessing import MinMaxScaler

In [88]:
scaler=MinMaxScaler()
df[['CreditScore','Age','Tenure','Balance','NumOfProducts','EstimatedSalary']]=scaler.fit_transform(df[['CreditScore','Age','Tenure','Balance','NumOfProducts','EstimatedSalary']])

In [89]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0.538,France,Female,0.324324,0.2,0.000000,0.000000,1,1,0.506735,1
1,0.516,Spain,Female,0.310811,0.1,0.334031,0.000000,0,1,0.562709,0
2,0.304,France,Female,0.324324,0.8,0.636357,0.666667,1,0,0.569654,1
3,0.698,France,Female,0.283784,0.1,0.000000,0.333333,0,0,0.469120,0
4,1.000,Spain,Female,0.337838,0.2,0.500246,0.000000,1,1,0.395400,0

In [90]:
x=pd.get_dummies(data=df,columns=['Geography','Gender'])

In [91]:
x.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,0.538,0.324324,0.2,0.000000,0.000000,1,1,0.506735,1,1,0,0,1,0
1,0.516,0.310811,0.1,0.334031,0.000000,0,1,0.562709,0,0,0,1,1,0
2,0.304,0.324324,0.8,0.636357,0.666667,1,0,0.569654,1,1,0,0,1,0
3,0.698,0.283784,0.1,0.000000,0.333333,0,0,0.469120,0,1,0,0,1,0
4,1.000,0.337838,0.2,0.500246,0.000000,1,1,0.395400,0,0,0,1,1,0

In [92]:
z=x.drop('Exited',axis=1)
y=x['Exited']

In [93]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(z,y,test_size=0.2)

In [94]:
model=keras.Sequential([
    keras.layers.Dense(10,input_shape=(13,),activation='relu'),
    keras.layers.Dense(5,activation='relu'),
    keras.layers.Dense(1,activation='sigmoid')
])

In [95]:
model.compile(optimizer='adam',loss='binary_crossentropy',metrics=['accuracy'])

In [96]:
X_train=np.asarray(x_train).astype(np.int)

y_train=np.asarray(y_train).astype(np.int)

<ipython-input-96-7dc24add4f11>:1: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  X_train=np.asarray(x_train).astype(np.int)
<ipython-input-96-7dc24add4f11>:3: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  y_train=np.asarray(y_train).astype(np.int)

In [97]:
model.fit(x_train,y_train,epochs=5)

Epoch 1/5
250/250 [==============================] - 1s 3ms/step - loss: 0.5353 - accuracy: 0.7906
Epoch 2/5
250/250 [==============================] - 0s 2ms/step - loss: 0.4757 - accuracy: 0.7977
Epoch 3/5
250/250 [==============================] - 0s 2ms/step - loss: 0.4679 - accuracy: 0.7977
Epoch 4/5
250/250 [==============================] - 1s 2ms/step - loss: 0.4626 - accuracy: 0.7977
Epoch 5/5
250/250 [==============================] - 0s 765us/step - loss: 0.4581 - accuracy: 0.7987

In [98]:
model.evaluate(x_test,y_test)

63/63 [==============================] - 0s 946us/step - loss: 0.4590 - accuracy: 0.7925

[0.4589678943157196, 0.7925000190734863]

In [99]:
y_pred=model.predict(x_test)

In [104]:
from sklearn.metrics import classification_report